Repository: DevilCoders/Yandex
Catalog: tools/snipmake/steam/service/site/steam/core/locale/*/LC_MESSAGES/django.po
Languages: ru

source: January
ru: Январь

source: February
ru: Февраль

source: March
ru: Март

source: April
ru: Апрель

source: May
ru: Май

source: June
ru: Июнь

source: July
ru: Июль

source: August
ru: Август

source: September
ru: Сентябрь

source: October
ru: Октябрь

source: November
ru: Ноябрь

source: December
ru: Декабрь

source: Su
ru: Вс

source: Mo
ru: Пн

source: Tu
ru: Вт

source: We
ru: Ср

source: Th
ru: Чт

source: Fr
ru: Пт

source: Sa
ru: Сб

source: Country
ru: Страна

source: First snippet pool
ru: Первый сниппетный пул

source: Second snippet pool
ru: Второй сниппетный пул

source: First pool
ru: Первый пул

source: Second pool
ru: Второй пул

source: Ignore bold
ru: Без учета прокраски

source: Title
ru: Заголовок

source: Kind
ru: Тип

source: Priority
ru: Приоритет

source: First pool filter
ru: Фильтр первого пула

source: Second pool filter
ru: Фильтр второго пула

source: Overlap
ru: Перекрытие

source: Deadline
ru: Дата окончания

source: Pack size
ru: Размер комплекта заданий

source: Deadline can not be less or equal than current date
ru: Дата окончания не может быть меньшей или равной текущей

source: Countries must differ
ru: Страны не должны повторяться

source: Unknown pool kind
ru: Неизвестный тип пула

source: Required field.
ru: Обязательное поле.

source: Pools should be different!
ru: Пулы должны различаться!

source: File
ru: Файл

source: Query bin %(title)s for %(country)s already exists. Please specify other values.
ru: Корзина запросов с названием %(title)s для страны %(country)s уже существует. Пожалуйста, выберите другие значения.

source: Incorrect query bin: error in line %d
ru: Некорректная корзина запросов: ошибка в строке %d

source: Choose
ru: Выбрать

source: Query bin
ru: Корзина запросов

source: Host
ru: Хост

source: CGI parameters
ru: CGI-параметры

source: Pool file
ru: Файл с пулом

source: Default template
ru: Шаблон по умолчанию

source: Snippet pool %(title)s is already being processed by STEAM. Please specify other value.
ru: Сниппетный пул %(title)s уже загружается в STEAM. Пожалуйста, выберите другое имя.

source: Snippet pool %(title)s already exists. Please specify other value.
ru: Сниппетный пул %(title)s уже существует. Пожалуйста, выберите другое имя.

source: Query bin not specified!
ru: Корзина запросов не указана!

source: Incorrect host!
ru: Неправильный хост!

source: Choose URL!
ru: Выберите URL!

source: Choose wizard URL!
ru: Выберите wizard URL!

source: Invalid CGI params!
ru: Неправильные CGI-параметры!

source: Pool file not specified!
ru: Файл с пулом не указан!

source: Wrong upload type "%s"
ru: Неверный тип загрузки "%s"

source: Title prefix
ru: Префикс заголовка

source: Base title suffix
ru: Суффикс заголовка для Base

source: Exp title suffix
ru: Суффикс заголовка для Exp

source: Two pools file
ru: Файл с двумя пулами

source: Base default template
ru: Шаблон по умолчанию для Base

source: Exp default template
ru: Шаблон по умолчанию для Exp

source: Suffixes should be different!
ru: Суффиксы должны различаться!

source: Snippet pools %(title_prefix)s* are already being processed by STEAM. Please specify other values.
ru: Сниппетные пулы %(title_prefix)s* уже загружаются в STEAM. Пожалуйста, выберите другие имена.

source: Snippet pools %(title_prefix)s* already exist. Please specify other values.
ru: Сниппетные пулы %(title_prefix)s* уже существуют. Пожалуйста, выберите другие имена.

source: Comment
ru: Комментарий

source: This field is required!
ru: Это поле обязательно для заполнения!

source: Answer
ru: Ответ

source: Subject
ru: Тема

source: Message
ru: Сообщение

source: No recipients specified
ru: Получатели не указаны

source: Not all recipients are in STEAM
ru: Не все получатели зарегистрированы в STEAM

source: All
ru: все

source: Start date
ru: Начальная дата

source: End date
ru: Конечная дата

source: Start date can not be greater than current date
ru: Начальная дата не может быть больше текущей

source: End date can not be greater than current date
ru: Конечная дата не может быть больше текущей

source: End date can not be less than start date
ru: Конечная дата не может быть меньше начальной

source: Russia
ru: Россия

source: Ukraine
ru: Украина

source: Turkey
ru: Турция

source: Albania
ru: Албания

source: Haiti
ru: Гаити

source: Developer
ru: Разработчик

source: Analyst
ru: Аналитик

source: Assessor
ru: Асессор

source: Assessor administrator
ru: Администратор асессоров

source: Active
ru: Активные

source: Wait approve
ru: Ждет подтверждения

source: Multi criterial
ru: Мультикритериальная оценка

source: Overlapped
ru: Набрал перекрытие

source: Finished
ru: Завершен

source: Disabled
ru: Отключен

source: TaskPool with this title already exists!
ru: Пул заданий с таким названием уже существует!

source: Timeout
ru: Просрочено

source: Regular
ru: Обычное

source: Inspection
ru: Проверочное

source: Complete
ru: Завершено

source: Assigned
ru: Назначено

source: Rejected
ru: Отклонено

source: Skipped
ru: Пропущено

source: informativity
ru: информативность

source: content_richness
ru: содержательность

source: readability
ru: читаемость

source: media_content
ru: качество медиаконтента

source: overall
ru: все

source: left
ru: левый

source: both
ru: одинаково

source: right
ru: правый

source: Estimation
ru: Оценка

source: Reported
ru: Отосланное

source: Actual
ru: Актуальное

source: Saved
ru: Сохраненное

source: Average
ru: Усредненное

source: Intersection
ru: Пересечение

source: Calculation
ru: Вычисление

source: Upload
ru: Загрузка

source: Sent
ru: Послан

source: Acknowledged
ru: Подтвержден

source: Question
ru: Вопрос

source: Recheck
ru: Перепроверка

source: DOWNLOADING
ru: ЗАГРУЗКА

source: STORING
ru: СОХРАНЕНИЕ

source: SUCCESS
ru: ГОТОВО

source: ERROR
ru: ОШИБКА

source: Add new
ru: Добавить

source: Add new query bin
ru: Добавление корзины запросов

source: Save
ru: Сохранить

source: Add new snippet pool
ru: Добавление сниппетного пула

source: Start taskpool
ru: Запуск пула заданий

source: Start
ru: Запустить

source: Add new taskpool
ru: Добавление пула заданий

source: Edit taskpool
ru: Редактирование пула заданий

source: current
ru: текущие

source: finished
ru: закрытые

source: checked
ru: проверенные

source: questions
ru: вопросы

source: available
ru: доступные

source: Request permissions
ru: Запросить права

source: Submit
ru: Отправить

source: STOPPED
ru: ОСТАНОВЛЕНО

source: all
ru: все

source: significant
ru: значимые

source: An error occured. Please try again later.
ru: Произошла ошибка. Пожалуйста, повторите отправку позже.

source: Assign pack back
ru: Продлить комплект

source: Renew taskpool deadline
ru: Обновить дедлайн пула заданий

source: You requested permissions at
ru: Вы запросили права в

source: Please wait. You will be notified on getting access.
ru: Пожалуйста, подождите. Вам сообщат, когда доступ будет выдан.

source: STEAM: permissions requested
ru: STEAM: запрос прав

source: User
ru: Пользователь

source: granted you permissions to access
ru: выдал Вам права на доступ к

source: STEAM: permissions granted
ru: STEAM: права выданы

source: The deadline for
ru: Срок окончания оценки

source: this task pack
ru: этого комплекта заданий

source: is today
ru: наступает сегодня

source: STEAM: deadline notification
ru: STEAM: уведомление об окончании оценки

source: The assessors in your country have completed the following tasks amount for previous month
ru: Асессоры из вашей страны за предыдущий месяц выполнили следующее число оценок

source: Login
ru: Логин

source: Total
ru: Всего

source: Linked
ru: Ссылок просмотрено

source: No estimations are available.
ru: Нет доступных оценок.

source: STEAM: monthly statistics
ru: STEAM: статистика за месяц

source: rub.
ru: руб.

source: tenge
ru: тнг.

source: Belarusian rubles
ru: б.р.

source: PLANNED
ru: ЗАПЛАНИРОВАНО

source: Multicriterial estimation
ru: Мультикритериальная оценка

source: Add two snippet pools
ru: Добавление двух сниппетных пулов

source: Assessor count
ru: Количество асессоров

source: Available tasks
ru: Доступные задания

source: Sorry, selected tasks are already assigned!
ru: Извините, но выбранные задания уже заняты!

source: User tasks
ru: Мои задания

source: Request
ru: Запрос

source: Search
ru: Найти

source: Showing results for request
ru: Показаны результаты по запросу

source: Total count
ru: Всего

source: Task
ru: Задание

source: Region
ru: Регион

source: Take tasks
ru: Взять задания

source: No tasks are available.
ru: Нет заданий.

source: Pool
ru: Пул

source: Estimation date
ru: Дата оценки

source: Correction date
ru: Дата исправления

source: Corrected by
ru: Исправлено пользователем

source: Estimation made by
ru: Оценено пользователем

source: Corrections
ru: Исправления

source: No corrections are available.
ru: Нет доступных исправлений.

source: Corrections page is available at
ru: Страница исправлений доступна в

source: You have to ask your question to assessor administrator in comment field before skipping a task!
ru: Перед тем, как отложить это задание, вы должны сформулировать свой вопрос для администратора асессоров в поле комментария!

source: Disabled task
ru: Отключенное задание

source: Expired task
ru: Просроченное задание

source: Complete task
ru: Завершенное задание

source: Assigned task
ru: Назначенное задание

source: Rejected task
ru: Отклоненное задание

source: Task under question
ru: Задание под вопросом

source: Estimation statistics
ru: Статистика по оценкам

source: Count
ru: Количество

source: Time
ru: Время

source: Assessors
ru: Асессоры

source: records displayed
ru: записей показано

source: estimations left
ru: оценок получено

source: Date
ru: Дата

source: Estimation count
ru: Всего оценок

source: Medians and minimums are displayed with zero times ignored.
ru: Медианы и минимумы показаны без учёта нулевых времён.

source: All estimations.
ru: Все оценки.

source: Linked estimations.
ru: Оценки с просмотренными ссылками.

source: Unlinked estimations.
ru: Оценки с непросмотренными ссылками.

source: Precision
ru: Точность

source: Timeout packs
ru: Комплектов просрочено

source: Totally
ru: Итого

source: No assessors are available.
ru: Нет пользователей.

source: Task pool
ru: Пул заданий

source: Skipped by
ru: Пропущено

source: Hotkeys
ru: Горячие клавиши

source: Submit estimation
ru: Отправить оценку

source: Reject this task
ru: Отказаться от задания

source: Are you sure?
ru: Вы уверены?

source: No
ru: Нет

source: Yes
ru: Да

source: Ask a question and skip
ru: Задать вопрос и пропустить

source: Previous criterion
ru: Предыдущий критерий

source: Next criterion
ru: Следующий критерий

source: You have already solved this task.
ru: Вы уже решали это задание.

source: Change estimation
ru: Изменить оценку

source: You have rejected this task.
ru: Вы отказались от этого задания.

source: Rejected by
ru: Отклонено пользователем

source: Estimation check
ru: Проверка оценок

source: Significant error
ru: Значимая ошибка

source: Sorry, this task was estimated by another user. Please review your corrections.
ru: Это задание было оценено другим пользователем. Пожалуйста, пересмотрите ваши исправления.

source: Sorry, new estimation was left during error processing. Please review your corrections.
ru: Во время обработки исправлений по этому заданию была оставлена новая оценка. Пожалуйста, пересмотрите ваши исправления.

source: You are viewing the corrections for actual estimation made by
ru: Вы видите исправления для актуальной оценки, оставленной пользователем

source: These corrections are draft. You must finish checking to send them to ANG.
ru: Эти исправления еще не подтверждены. Завершите проверку, чтобы они могли быть отосланы в ANG.

source: Filter
ru: Фильтр

source: All estimations
ru: Все оценки

source: Nobody has completed this task yet. You may press "Finish checking" if you would like to complete this task.
ru: Никто пока не решил это задание. Вы можете нажать "Завершить проверку", чтобы закрыть это задание.

source: Check later
ru: Отложить

source: Finish checking
ru: Завершить проверку

source: Compose a letter
ru: Написать письмо

source: This task is checked. If you wish to change estimation, you should check error values again to keep ANG statistics actual.
ru: Это задание уже проверено. Если Вы хотите изменить оценку, вам нужно будет проверить его снова, для того чтобы в ANG была отправлена актуальная статистика.

source: Help
ru: Помощь

source: Main page
ru: Главная страница

source: Choose your language
ru: Язык

source: Estimations
ru: Оценки

source: Tasks
ru: Задания

source: Task pools
ru: Пулы заданий

source: Statistics
ru: Статистика

source: Requests
ru: Запросы

source: Query bins
ru: Корзины запросов

source: Snippet pools
ru: Сниппетные пулы

source: Background task monitor
ru: Монитор фоновых задач

source: Management
ru: Управление

source: Waiting users
ru: Пользователи, ожидающие подтверждения

source: Roles management
ru: Управление ролями

source: Files in storage
ru: Файлы в хранилище

source: Log out
ru: Выйти

source: Background task
ru: Фоновая задача

source: Status
ru: Статус

source: Owning user
ru: Владелец

source: Start time
ru: Время старта

source: No background tasks are available.
ru: Нет фоновых задач.

source: Storing snippet pool
ru: Сохранение сниппетного пула

source: Downloading SERP
ru: Загрузка SERP

source: Stop
ru: Остановить

source: Monitor task pool
ru: Мониторинг пула заданий

source: Name
ru: Имя

source: Estimated
ru: Оценено

source: Packs taken
ru: Комплектов взято

source: Last activity
ru: Последняя активность

source: Pack status
ru: Статус комплекта

source: Remove country
ru: Удалить страну

source: Add country
ru: Добавить страну

source: Active task pack
ru: Комплект заданий в оценке

source: Finished task pack
ru: Завершенный комплект заданий

source: Expired task pack
ru: Просроченный комплект заданий

source: Complete task count
ru: Завершенных заданий

source: Rejected task count
ru: Отклоненных заданий

source: Choose a file to upload!
ru: Выберите файл для загрузки!

source: Cancel
ru: Отмена

source: An error occurred during QueryBin storing! Please try again or contact developer.
ru: При сохранении корзины запросов произошла ошибка. Пожалуйста, повторите еще раз или свяжитесь с разработчиком.

source: Bin title
ru: Корзина запросов

source: Request count
ru: Количество запросов

source: Upload date
ru: Время загрузки

source: Action
ru: Действие

source: Delete
ru: Удалить

source: No query bins are available.
ru: Нет корзин запросов.

source: Type
ru: Тип

source: Info
ru: Дополнительная информация

source: No raw files are available.
ru: Нет файлов.

source: Request permission
ru: Запросить права

source: Your request is processed. Please wait or contact developer.
ru: Ваш запрос обрабатывается. Пожалуйста, подождите или свяжитесь с разработчиком.

source: You are not in STEAM yet. But you can request it here.
ru: Вы не являетесь зарегистрированным пользователем STEAM. Необходимо подать заявку.

source: Roles
ru: Роли

source: Removing all developers is prohibited!
ru: Удаление всех разработчиков запрещено!

source: Role
ru: Роль

source: No users are available.
ru: Нет пользователей.

source: Recipients
ru: Получатели

source: Back
ru: Назад

source: Send
ru: Отправить

source: Download serp
ru: Скачать SERP

source: Upload pool
ru: Загрузить пул

source: Pool title
ru: Название пула

source: Snippet count
ru: Количество сниппетов

source: Export
ru: Экспорт

source: No snippet pools are available.
ru: Нет сниппетных пулов.

source: Snippets
ru: Сниппеты

source: Snippet pool
ru: Сниппетный пул

source: Body
ru: Тело

source: MediaContent
ru: Медиaконтент

source: Query
ru: Запрос

source: Lines
ru: Строки

source: No snippets are available.
ru: Нет сниппетов.

source: Tasks type
ru: Тип заданий

source: Estimation mode
ru: Режим оценки

source: Unique estimation amount
ru: Всего уникальных оценок

source: Integral data
ru: Интегральные данные

source: Corrected
ru: Исправленные

source: Original
ru: Исходные

source: Filter selected
ru: Выбран фильтр

source: Different estimations
ru: Разные оценки

source: Opposite estimations
ru: Противоположные оценки

source: Not null diff size
ru: Ненулевых разностей

source: No data on snippet lines!
ru: Нет данных по длине сниппета в строках!

source: Grouped by users
ru: Группировка по пользователям

source: Criterion
ru: Критерий

source: No estimations available.
ru: Нет доступных оценок.

source: Task list
ru: Список заданий

source: Can not delete this task because it has estimations!
ru: Нельзя удалить это задание, так как по нему уже есть оценки!

source: Sort order
ru: Порядок сортировки

source: Alphabetical
ru: Алфавитный

source: Random
ru: Случайный

source: This TaskPool not found! Please reload page or contact developer.
ru: Запрашиваемый пул заданий не найден! Пожалуйста, перезагрузите страницу или свяжитесь с разработчиком.

source: Taskpool wasn't created because it doesn't contain any tasks!
ru: Пул заданий не создан, так как не содержал ни одного задания!

source: Taskpool with 1 task was created!
ru: Создан пул из %(counter)s задания!

source: No complete estimations for this taskpool!
ru: В этом пуле заданий нет завершенных оценок!

source: Non-ANG
ru: Аналитика

source: Disable temporarily
ru: Отключить временно

source: Finish permanently
ru: Завершить окончательно

source: Estimation type
ru: Тип оценки

source: Create date
ru: Дата создания

source: View
ru: Просмотреть

source: Monitor
ru: Мониторинг

source: Edit
ru: Редактировать

source: No taskpools are available.
ru: Нет пулов заданий.

source: Pool kind
ru: Тип пула

source: Displayed
ru: Отображено

source: Tasks displayed
ru: Отображаемые задания

source: Inspection only
ru: Только проверочные

source: checked by
ru: проверено

source: me
ru: мной

source: Incomplete
ru: Не завершено

source: Assign to me
ru: Взять в оценку

source: Step
ru: Этап

source: sec.
ru: сек.

source: Median
ru: Медиана

source: You must upload a file!
ru: Необходимо загрузить файл!

source: User profile
ru: Профиль пользователя

source: This TaskPack is from disabled TaskPool! Please wait until TaskPool is finished.
ru: Этот комплект заданий из отключенного пула! Пожалуйста, дождитесь его завершения.

source: User has no estimations for checking!
ru: Нет оценок для допроверки пользователя!

source: got
ru: получено

source: needed
ru: требуется

source: Assign task by assessor
ru: Допроверить асессора

source: Clear open estimations
ru: Удалить открытые оценки

source: Changed
ru: Изменено

source: Assign back
ru: Продлить

source: Has comment
ru: Есть комментарий

source: Sorry, selected pack is already assigned!
ru: Извините, но выбранный комплект уже занят!

source: Sorry, selected pack is not available. Check you have a link to STEAM in your ANG tasks.
ru: Извините, но выбранный комплект недоступен. Убедитесь, что в списке ваших заданий в АНГе есть ссылка на STEAM.

source: Available pack
ru: Доступный комплект заданий

source: Take pack
ru: Взять комплект

source: Task disabled!
ru: Задание заблокировано!

source: Task expired!
ru: Задание просрочено!

source: Task does not exist!
ru: Такого задания нет!

source: You can not check this task
ru: Вы не можете проверять это задание

source: This task is not yet checked
ru: Это задание еще не проверено

source: This task is disabled
ru: Это задание заблокировано

source: Changes in STEAM
ru: Изменения в STEAM

source: Tasks are now distributed in packs: you can take a pack of a particular number of tasks that must be closed until deadline.
ru: Теперь задания распределяются по комплектам: вы можете взять комплект из определенного числа заданий, взятый комплект должен быть решен до крайнего срока.

source: You can see available packs on the &laquo;Available&raquo; tab.
ru: Доступные комплекты находятся на вкладке &laquo;Доступные&raquo;.

source: You can change your complete estimations now.
ru: Появилась возможность менять оценки в сделанных заданиях.

source: The estimation process is now separated into 3 steps: at first you estimate readability, then you are given the document URL and estimate content-richness, and finally you are given the query and estimate informativity.
ru: Процесс оценки теперь разделен на 3 шага. Подробное описание процесса находится <a href='https://ang2.yandex-team.ru/wiki/-view?page=MulticriterialSideBySide' target='_blank'>по этой ссылке</a>.

source: You have no current tasks right now. Please check out the &laquo;Available&raquo; tab to get new tasks.
ru: На данный момент у вас нет текущих заданий. Проверьте вкладку &laquo;Доступные&raquo;, чтобы взять новые задания.

source: Grant permissions
ru: Выдать права

source: No waiting users are available.
ru: Нет пользователей.

source: Yandex.Passport authentication
ru: Вход в Яндекс.Паспорт

source: Password
ru: Пароль

source: Log in
ru: Войти

source: New question was asked
ru: Задан новый вопрос

source: about this task
ru: по этому заданию

source: New estimation submitted for
ru: Получена новая оценка

source: this task
ru: по этому заданию

source: Please recheck it
ru: Пожалуйста, перепроверьте его

source: References to this page contain:
ru: Ссылки на страницу содержат:

source: from
ru: от

source: Unknown region: %(region_id)s
ru: Неизвестный регион: %(region_id)s
