module.exports = {
    "search-page": {
        "active": "Искать в активных конфигах",
        "active-hint": "Поиск по активным конфигам (примененным и тестовым)",
        "all": "Все",
        "search-input-hint": "Поиск по конфигам (не архивным). \nЕсть два режима поиска:\n - по ключам\n - по содержимому. \nПримеры запросов:\n'abc' - конфиг, в котором есть abc\n'BODY_CRYPT_RE: abc' - конфиг, в котором параметр BODY_CRYPT_RE содержит abc\n'\"BODY_CRYPT_RE: abc\"' - ищет конфиг, в котором есть строка 'BODY_CRYPT_RE: abc'",
        "total": "Найдено конфигов"
    }
};
