module.exports = {
    "datetime": {
        "ago": "назад",
        "apr": "Апр",
        "aug": "Авг",
        "day": [
            "день",
            "дня",
            "дней",
            "дней"
        ],
        "dec": "Дек",
        "feb": "Фев",
        "friday": "Пятница",
        "hour": [
            "час",
            "часа",
            "часов",
            "часов"
        ],
        "jan": "Янв",
        "jul": "Июл",
        "jun": "Июн",
        "less-than": "меньше",
        "mar": "Мар",
        "may": "Май",
        "minute": [
            "минуту",
            "минуты",
            "минут",
            "минут"
        ],
        "monday": "Понедельник",
        "month": [
            "месяц",
            "месяца",
            "месяцев",
            "месяцев"
        ],
        "nov": "Ноя",
        "oct": "Окт",
        "saturday": "Суббота",
        "second": [
            "секунду",
            "секунды",
            "секунд",
            "секунд"
        ],
        "sept": "Сен",
        "sunday": "Воскресенье",
        "thursday": "Четверг",
        "tuesday": "Вторник",
        "wednesday": "Среда",
        "week": [
            "неделю",
            "недели",
            "недель",
            "недель"
        ],
        "year": [
            "год",
            "года",
            "лет",
            "лет"
        ]
    }
};
