module.exports = {
    "error": {
        "default": "Что-то пошло не так.\nПопробуйте ещё раз или обратитесь в службу поддержки.",
        "empty-key": "Пустой ключ",
        "not-allowed": "Доступ запрещен.",
        "not-found": "Возможно нужная вам страница была удалена.\nЕсли вы считаете, что страницы нет по нашей вине, напишите нам.",
        "same-key": "Одинаковые ключи",
        "try-again-message": "Что-то пошло не так.\nПопробуйте ещё раз или обратитесь в службу поддержки.",
        "validation-error": "Ошибка валидации"
    }
};
